% Завдання 1: Завантажити з бібліотеки MATLAB тестове зображення.
I = imread('cameraman.tif');

% Завдання 2: Відобразити вихідні зображення на екрані ПК.
figure;
imshow(I);
title('Вихідне зображення');

% Завдання 3: Здійснити процедуру перекручення зображення змінюючи параметри LEN і THETA.
LEN = 21; % Довжина змазування
THETA = 30; % Кут змазування
PSF = fspecial('motion', LEN, THETA);
blurred = imfilter(I, PSF, 'conv', 'circular');

% Завдання 4: Відобразити перекручене зображення.
figure;
imshow(blurred);
title('Змазане зображення');

% Завдання 5: Виконати процедуру відновлення зображення.
wnr1 = deconvwnr(blurred, PSF, 0);

% Завдання 6: Відобразити зображення після відновлення.
figure;
imshow(wnr1);
title('Відновлене зображення');

% Завдання 7: Виконати зашумлення початкового зображення та повторити пункти 2-6.
% Додаємо шум до вихідного зображення
noisy = imnoise(I,'gaussian',0,0.01); % Додаємо гауссівський шум

% Відображення зашумленого зображення
figure;
imshow(noisy);
title('Зашумлене вихідне зображення');

% Перекручення зашумленого зображення
noisy_blurred = imfilter(noisy, PSF, 'conv', 'circular');

% Відображення перекрученого зашумленого зображення
figure;
imshow(noisy_blurred);
title('Перекручене і зашумлене зображення');

% Відновлення зашумленого перекрученого зображення
% Оскільки в нашому випадку є шум, SNR (відношення сигнал/шум) має бути вказано.
% Для прикладу візьмемо SNR = 0.01 (це значення можна регулювати в залежності від рівня шуму)
wnr2 = deconvwnr(noisy_blurred, PSF, 0.01);

% Відображення відновленого зашумленого перекрученого зображення
figure;
imshow(wnr2);
title('Відновлене зашумлене і перекручене зображення');
